Revit 2025 API
ShellLayerType Enumeration
 Used to distinguish exterior and interior shell layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ShellLayerType
Public Enumeration ShellLayerType
public enum class ShellLayerType
type ShellLayerType
Members
Member name | Value | Description
Interior | 0 |  Interior shell layer.
Exterior | 1 |  Exterior shell layer.
Remarks
 Used as an argument to methods of CompoundStructure that deal with shell layers.
See Also
Reference
Autodesk.Revit.DB Namespace